/*

Сделать флаг, когда заходим для перестановки - поднимаем его..

{ 9, -1, 3, 7, -5, -7, 1, 3, -3, 2, 1, -8 }
int number = 9
int indexMax = 0  ---> присваем индекс мин ---> 2

Меняем местами
int min = 3
int indexMin = 0

{ 3, -1, 9, 7, -5, -7, 1, 3, -3, 2, 1, -8 }

int number = 9
int indexMax = 2  ---> присваем индекс мин ---> 3

int min = 7
int indexMin = 2

{ 3, -1, 7, 9, -5, -7, 1, 3, -3, 2, 1, -8 }

int number = 9
int indexMax = 3  ---> присваем индекс мин ---> 6

int min = 1
int indexMin = 3

{ 3, -1, 7, 1, -5, -7, 9, 3, -3, 2, 1, -8 }






→ { 1, -1, 1, 2, -5, -7, 3, 3, -3, 7, 9, -8 }























 */